models/c4/structurizr-CustomerOrdersContext.puml
@startuml
set separator none
title Customer Orders - System Context

top to bottom direction

!include <C4/C4>
!include <C4/C4_Context>

AddBoundaryTag("Snack Shop", $borderColor="#cccccc", $fontColor="#cccccc", $borderStyle="dashed")
Boundary(group_1, "Snack Shop", $tags="Snack Shop") {
  System(WarehouseLogistics, "Warehouse Logistics", $descr="Manages all deliveries and stock", $tags="", $link="")
  System(SnackShopWeb, "Snack Shop Web", $descr="Allows customers to place and track orders for tasty treats", $tags="", $link="")
  System(CustomerOrders, "Customer Orders", $descr="Keeps track of all new and historical orders from purchase to dispatch", $tags="", $link="")
}


Rel(SnackShopWeb, CustomerOrders, "Raises order", $techn="", $tags="", $link="")
Rel(CustomerOrders, WarehouseLogistics, "Requests stock allocation", $techn="", $tags="", $link="")
Rel(WarehouseLogistics, CustomerOrders, "Update order status", $techn="", $tags="", $link="")

SHOW_LEGEND(true)
@enduml
